c5/src/Documents/Sale/Sale.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Sale</name>
  <basedOn>Document.Invoice</basedOn>
  <basedOn>Document.Return</basedOn>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.SaleBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Return</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Taken</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/Sale/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	init ();
	filterByWarehouse ();
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure init ()
	
	settings = Logins.Settings ( "Warehouse" );
	WarehouseFilter = settings.Warehouse;
	
EndProcedure

&AtServer
Procedure filterByWarehouse ()
	
	set = not WarehouseFilter.IsEmpty ();
	DC.ChangeFilter ( List, "Warehouse", WarehouseFilter, set );
	DC.ChangeFilter ( Accounting, "Warehouse", WarehouseFilter, set );
	Appearance.Apply ( ThisObject, "WarehouseFilter" );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Warehouse AccountingWarehouse show empty ( WarehouseFilter );
	|Creator AccountingCreator show empty ( CreatorFilter );
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure WarehouseFilterOnChange ( Item )
	
	filterByWarehouse ();
	
EndProcedure

&AtClient
Procedure CreatorFilterOnChange ( Item )
	
	filterByCreator ();

EndProcedure

&AtServer
Procedure filterByCreator ()
	
	set = not CreatorFilter.IsEmpty ();
	DC.ChangeFilter ( List, "Creator", CreatorFilter, set );
	DC.ChangeFilter ( Accounting, "Creator", CreatorFilter, set );
	Appearance.Apply ( ThisObject, "CreatorFilter" );
	
EndProcedure

// *****************************************
// *********** Accounting

&AtClient
Procedure Calculate ( Command )
	
	OpenForm ( "DataProcessor.RetailSales.Form", , Items.Accounting );

EndProcedure

&AtClient
Procedure AccountingChoiceProcessing ( Item, ValueSelected, StandardProcessing )
	
	go ( ValueSelected );
	Progress.Open ( UUID, ThisObject, new NotifyDescription ( "Complete", ThisObject ) );
	
EndProcedure

&AtServer
Procedure go ( val Data )

	p = DataProcessors.RetailSales.GetParams ();
	p.Company = Data.Company;
	p.Warehouse = Data.Warehouse;
	p.Department = Data.Department;
	p.Location = Data.Location;
	p.Method = Data.Method;
	p.Day = Data.Day;
	p.Memo = Data.Memo;
	ResultAddress = PutToTempStorage ( undefined, UUID );
	p.Address = ResultAddress;
	args = new Array ();
	args.Add ( "RetailSales" );
	args.Add ( p );
	Jobs.Run ( "Jobs.ExecProcessor", args, UUID, , TesterCache.Testing () );
	
EndProcedure

&AtClient
Procedure Complete ( Result, Params ) export
	
	notifyChanges ();
	if ( Result ) then
		Output.ProcessCompleted ();
	endif;

EndProcedure

&AtClient
Procedure notifyChanges ()
	
	changes = GetFromTempStorage ( ResultAddress );
	if ( changes <> undefined ) then
		for each ref in changes do
			NotifyChanged ( ref );
		enddo;
	endif;

EndProcedure
